app/Controllers/AdminController.php

    public function dashboard()
    {
        $role = session()->get('role');

        if ($role == 1 || $role == 2) {

            $projectModel = new ProjectModel();
            $meetingModel = new MeetingModel();
            $userModel = new UserModel();
            $userInfoModel = new UserInfoModel();

            $projectCount = $projectModel->countAllResults();
            $meetingCount = $meetingModel->countAllResults();
            $staffCount = $userModel->where('role', 2)->countAllResults();

            if ($role == 1) {
                $projectCount = $projectModel->countAllResults();
                $meetingCount = $meetingModel->countAllResults();
                $staffCount = $userModel->where('role', 2)->countAllResults();

                $latestProjects = $projectModel
                    ->select('projects.project_name, projects.budget, projects.start_date, projects.end_date, users.username')
                    ->join('users', 'users.id = projects.user_id')
                    ->orderBy('projects.id', 'DESC')
                    ->findAll();

                $latestStaff = $userInfoModel
                    ->select('users.email, users_info.name, users_info.address, users_info.phone_no, users_info.profile_image, users_info.id')
                    ->join('users', 'users.id = users_info.user_id')
                    ->where('users.role', 2)
                    ->orderBy('users_info.id', 'DESC')
                    ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
SELECT COUNT(*) AS `numrows`
FROM `meetings`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 2
SELECT `projects`.`project_name`, `projects`.`budget`, `projects`.`start_date`, `projects`.`end_date`, `users`.`username`
FROM `projects`
JOIN `users` ON `users`.`id` = `projects`.`user_id`
ORDER BY `projects`.`id` DESC
SELECT `users`.`email`, `users_info`.`name`, `users_info`.`address`, `users_info`.`phone_no`, `users_info`.`profile_image`, `users_info`.`id`
FROM `users_info`
JOIN `users` ON `users`.`id` = `users_info`.`user_id`
WHERE `users`.`role` = 2
ORDER BY `users_info`.`id` DESC

            }

            if ($role == 2) {
                $projectCount = $projectModel->where('user_id', session()->get('user_id'))->countAllResults();
                $meetingCount = $meetingModel->where('user_id', session()->get('user_id'))->countAllResults();

                $latestProjects = $projectModel
                    ->select('projects.project_name, projects.budget, projects.start_date, projects.end_date, users.username')
                    ->join('users', 'users.id = projects.user_id')
                    ->where('user_id', session()->get('user_id'))
                    ->orderBy('projects.id', 'DESC')
                    ->findAll();

                $latestMeetings = $meetingModel
                    ->select('meetings.meeting_title, meetings.meeting_date, meetings.start_time, meetings.end_time')
                    ->where('user_id', session()->get('user_id'))
                    ->orderBy('meetings.id', 'DESC')
                    ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `projects`
WHERE `user_id` = '22'
SELECT COUNT(*) AS `numrows`
FROM `meetings`
WHERE `user_id` = '22'
SELECT `projects`.`project_name`, `projects`.`budget`, `projects`.`start_date`, `projects`.`end_date`, `users`.`username`
FROM `projects`
JOIN `users` ON `users`.`id` = `projects`.`user_id`
WHERE `user_id` = '22'
ORDER BY `projects`.`id` DESC
SELECT `meetings`.`meeting_title`, `meetings`.`meeting_date`, `meetings`.`start_time`, `meetings`.`end_time`
FROM `meetings`
WHERE `user_id` = '22'
ORDER BY `meetings`.`id` DESC