app/Controllers/MeetingController.php

    public function fetchAll()
    {
        $meetingModel = new MeetingModel();
        $user_id = session()->get('user_id');
        $role = session()->get('role');

        if ($role == 2) {
            $meetings = $meetingModel
                ->select('meetings.id, meetings.meeting_title, meetings.meeting_date, meetings.start_time, meetings.end_time, projects.end_date, users.username, projects.project_name')
                ->join('users', 'users.id = meetings.user_id')
                ->join('projects', 'projects.id = meetings.project_id')
                ->where('meetings.user_id', $user_id)
                ->orderBy('meetings.id', 'DESC')
                ->findAll();
        } else {
            $meetings = $meetingModel
                ->select('meetings.id, meetings.meeting_title, meetings.meeting_date, meetings.start_time, meetings.end_time, projects.end_date, users.username, projects.project_name')
                ->join('users', 'users.id = meetings.user_id')
                ->join('projects', 'projects.id = meetings.project_id')
                ->orderBy('meetings.id', 'DESC')
                ->findAll();
---
SELECT `meetings`.`id`, `meetings`.`meeting_title`, `meetings`.`meeting_date`, `meetings`.`start_time`, `meetings`.`end_time`, `projects`.`end_date`, `users`.`username`, `projects`.`project_name`
FROM `meetings`
JOIN `users` ON `users`.`id` = `meetings`.`user_id`
JOIN `projects` ON `projects`.`id` = `meetings`.`project_id`
ORDER BY `meetings`.`id` DESC

    public function details($id)
    {
        $model = new MeetingModel();

        $meeting = $model
            ->select('meetings.meeting_title, users.username, projects.project_name, meetings.meeting_date, meetings.start_time, meetings.end_time, meetings.agenda, meetings.location')
            ->join('users', 'users.id = meetings.user_id')
            ->join('projects', 'projects.id = meetings.project_id')
            ->where('meetings.id', $id)
            ->first();
---
SELECT `meetings`.`meeting_title`, `users`.`username`, `projects`.`project_name`, `meetings`.`meeting_date`, `meetings`.`start_time`, `meetings`.`end_time`, `meetings`.`agenda`, `meetings`.`location`
FROM `meetings`
JOIN `users` ON `users`.`id` = `meetings`.`user_id`
JOIN `projects` ON `projects`.`id` = `meetings`.`project_id`
WHERE `meetings`.`id` = '4'
 LIMIT 1