app/Controllers/UserInfoController.php

SELECT `users`.`email`, `users_info`.`profile_image`, `users_info`.`id`, `users_info`.`name`, `users_info`.`gender`, `users_info`.`address`, `users_info`.`city`, `users_info`.`phone_no`
FROM `users_info`
JOIN `users` ON `users`.`id` = `users_info`.`user_id`
WHERE `users`.`role` = 2
ORDER BY `users_info`.`id` DESC
---
    public function fetchAll()
    {
        $userModel = new UserModel();
        $userInfoModel = new UserInfoModel();

        $users = $userInfoModel
            ->select('users.email, users_info.profile_image, users_info.id, users_info.name, users_info.gender, users_info.address, users_info.city, users_info.phone_no')
            ->join('users', 'users.id = users_info.user_id')
            ->where('users.role', 2)
            ->orderBy('users_info.id', 'DESC')
            ->findAll();