app/Models/ChatModel.php

    public function getMessages($sender_id, $receiver_id)
    {
        return $this->builder()
            ->groupStart()
                ->where('sender_id', $sender_id)
                ->where('receiver_id', $receiver_id)
            ->groupEnd()
            ->orGroupStart()
                ->where('sender_id', $receiver_id)
                ->where('receiver_id', $sender_id)
            ->groupEnd()
            ->orderBy('sent_at', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `chats`
WHERE   (
`sender_id` = '22'
AND `receiver_id` = '15'
 )
OR   (
`sender_id` = '15'
AND `receiver_id` = '22'
 )
ORDER BY `sent_at` ASC