app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
AND `password` = 'c33367701511b4f6020ec61ded352059'
 LIMIT 1
---
    public function validateUser($email, $password)
    {
        return $this->where('email', $email)
            ->where('password', md5($password))
            ->first();